9front-iso.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-03 Wed 23:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>building a 9front iso</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">building a 9front iso</h1>
<p>
instructions for building an iso are detailed in <a href="http://fqa.9front.org/fqa5.html#5.3">fqa 5.3</a>.
</p>

<blockquote>
<p>
5.3 - Building an ISO
</p>

<p>
The 9front ISO is a livecd that also serves as install media.
</p>

<p>
Note: Currently, only the 386 and amd64 architectures have downloadable ISOs (rpi has a bootable image). Read: FQA 8.9 - Bootstrapping architectures not included on the ISO for more information on booting other architectures.
</p>

<p>
<code># put your root file system into /n/src9</code><br />
<code>bind /root /n/src9</code>
</p>

<p>
<code># put your hg repository there</code><br />
<code>bind -ac /dist/plan9front /n/src9</code>
</p>

<p>
<code># build the iso</code><br />
<code>cd /sys/lib/dist</code><br />
<code>mk /tmp/9front.$objtype.iso</code>
</p>
</blockquote>

<p>
other than that 'hg' should probably be 'git' unless you are using
some ancient 9front version. it seems to work
</p>

<p>
it also seems to do weird stuff if you are cross-compiling the iso,
you might have to install the target arch as your current
system<sup>[citation needed]</sup>
</p>
</div>
</body>
</html>
